Revit 2027 API
Application.NewCombinableElementArray Method
Returns an array that can hold combinable element objects.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CombinableElementArray NewCombinableElementArray()
Public Function NewCombinableElementArray As CombinableElementArray
public:
CombinableElementArray^ NewCombinableElementArray()
member NewCombinableElementArray : unit -> CombinableElementArray
Return Value
CombinableElementArray
An empty array that can contain any CombinableElement derived objects.
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace